#Использовать errors

#Область ПрограммныйИнтерфейс

// Классифицирует исключение нативных объектов чтения и записи XML.
//
// Параметры:
//  Ошибка - ИнформацияОбОшибке - Исходная нативная ошибка.
//  Распознаватель - РаспознавательЦепочкиОшибок - Распознаватель цепочки ошибки.
//
// Возвращаемое значение:
//  ИнформацияОбОшибке, Неопределено - Нормализованная ошибка или Неопределено, если ошибка не распознана.
Функция Классифицировать(Ошибка, Распознаватель) Экспорт

	ШаблонЗаписьНеОткрыта =
		"ru = 'Приемник данных XML не открыт'; en = 'XML data target is not opened'";
	Если Распознаватель.СодержитТочноеСообщение(ШаблонЗаписьНеОткрыта) Тогда
		Возврат ОшибкаЗаписиНеОткрыта(Ошибка);
	КонецЕсли;
	ШаблонПорядкаЗаписи =
		"ru = 'Ошибочный порядок записи XML';"
			+ "en = 'Wrong order of XML record'";
	Если Распознаватель.СодержитТочноеСообщение(ШаблонПорядкаЗаписи) Тогда
		Возврат ОшибкаПорядкаЗаписи(Ошибка);
	КонецЕсли;

	НативныйТип = "System.Xml.XmlException";
	Если Распознаватель.СодержитТип(НативныйТип) Тогда
		Возврат ОшибкаНекорректногоXML(Ошибка, НативныйТип);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОшибкаНекорректногоXML(Ошибка, НативныйТип)
	КодОшибки = КодыНативныхОшибок.XMLНекорректныйСинтаксис();
	Данные = Новый Структура;
	Данные.Вставить("Источник", "ЧтениеXML");
	Данные.Вставить("НативныйТип", НативныйТип);
	Данные.Вставить("Правило", КодОшибки);

	Возврат ФабрикаОшибок.Обернуть(
		Ошибка,
		КодОшибки,
		НСтр(
			"ru = 'Некорректные данные XML';"
				+ "en = 'Invalid XML data'"
		),
		Данные
	);

КонецФункции

Функция ОшибкаПорядкаЗаписи(Ошибка)
	КодОшибки = КодыНативныхОшибок.XMLНекорректноеСостояниеЗаписи();
	Данные = Новый Структура("Источник, Правило", "ЗаписьXML", КодОшибки);
	Возврат ФабрикаОшибок.Обернуть(
		Ошибка,
		КодОшибки,
		НСтр("ru = 'Нарушен порядок операций записи XML'; en = 'Invalid order of XML writing operations'"),
		Данные
	);
КонецФункции

Функция ОшибкаЗаписиНеОткрыта(Ошибка)
	КодОшибки = КодыНативныхОшибок.XMLЗаписьНеОткрыта();
	Данные = Новый Структура("Источник, Правило", "ЗаписьXML", КодОшибки);
	Возврат ФабрикаОшибок.Обернуть(
		Ошибка,
		КодОшибки,
		НСтр("ru = 'ЗаписьXML не открыта'; en = 'XMLWriter is not open'"),
		Данные
	);
КонецФункции

#КонецОбласти
