#Использовать errors

Перем _Правила; // ФиксированныйМассив из ПравилоКлассификацииНативныхОшибок

#Область ОбработчикиСобытий

// Создает каталог встроенных правил классификации нативных ошибок.
Процедура ПриСозданииОбъекта()

	Правила = Новый Массив;

	ДобавитьПравилаФайловойСистемы(Правила);
	ДобавитьПравилаПотоков(Правила);
	ДобавитьПравилаJSON(Правила);
	ДобавитьПравилаXML(Правила);
	ДобавитьПравилаZIP(Правила);
	ДобавитьПравилаТекста(Правила);
	ДобавитьПравилаСтроковыхОпераций(Правила);
	ДобавитьПравилаДвоичныхДанных(Правила);
	ДобавитьПравилаОбъектов(Правила);
	ДобавитьПравилаHTTP(Правила);

	_Правила = Новый ФиксированныйМассив(Правила);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает встроенные правила классификации нативных ошибок.
//
// Возвращаемое значение:
//  ФиксированныйМассив из ПравилоКлассификацииНативныхОшибок - Правила классификации.
Функция Все() Экспорт

	Возврат _Правила;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПравилаФайловойСистемы(Правила)

	СообщениеРесурсНеНайден = "ru = 'Файл или каталог не найден'; en = 'File or directory not found'";

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПоТипу(),
		"System.UnauthorizedAccessException",
		"",
		"",
		КодыНативныхОшибок.ФайловаяСистемаДоступЗапрещен(),
		"ru = 'Доступ к файлу или каталогу запрещён'; en = 'Access to file or directory is denied'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.IO.IOException",
		"ru = 'Файл '''; en = 'The file '''",
		"ru = ''' уже существует.'; en = ''' already exists.'",
		КодыНативныхОшибок.ФайловаяСистемаРесурсУжеСуществует(),
		"ru = 'Файл уже существует'; en = 'File already exists'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.IO.IOException",
		"ru = 'Процесс не может получить доступ к файлу ''';"
			+ "en = 'The process cannot access the file '''",
		"ru = ''', так как этот файл используется другим процессом.';"
			+ "en = ''' because it is being used by another process.'",
		КодыНативныхОшибок.ФайловаяСистемаРесурсЗанят(),
		"ru = 'Файл уже используется'; en = 'File is already in use'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПоТипу(),
		"System.IO.FileNotFoundException",
		"",
		"",
		КодыНативныхОшибок.ФайловаяСистемаРесурсНеНайден(),
		СообщениеРесурсНеНайден
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПоТипу(),
		"System.IO.DirectoryNotFoundException",
		"",
		"",
		КодыНативныхОшибок.ФайловаяСистемаРесурсНеНайден(),
		СообщениеРесурсНеНайден
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"Could not find file '",
		"",
		КодыНативныхОшибок.ФайловаяСистемаРесурсНеНайден(),
		СообщениеРесурсНеНайден
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"Could not find a part of the path '",
		"",
		КодыНативныхОшибок.ФайловаяСистемаРесурсНеНайден(),
		СообщениеРесурсНеНайден
	);

КонецПроцедуры

Процедура ДобавитьПравилаПотоков(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Попытка записи в поток не поддерживающий запись';"
			+ "en = 'Cannot write to a stream that does not support writing'",
		"",
		КодыНативныхОшибок.ПотокНеПоддерживаетЗапись(),
		"ru = 'Поток не поддерживает запись'; en = 'Stream does not support writing'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Ошибка обращения к закрытому потоку'; en = 'Cannot access a closed stream'",
		"",
		КодыНативныхОшибок.ПотокЗакрыт(),
		"ru = 'Поток закрыт'; en = 'Stream is closed'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ObjectDisposedException",
		"",
		"ru = 'Доступ к закрытому потоку невозможен.'; en = 'Cannot access a closed Stream.'",
		КодыНативныхОшибок.ПотокЗакрыт(),
		"ru = 'Поток закрыт'; en = 'Stream is closed'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentOutOfRangeException",
		"",
		"ru = 'Смещение и длина находились вне границ массива.';"
			+ "en = 'Offset and length were out of bounds for the array or count is greater than the number "
			+ "of elements from index to the end of the source collection. (Parameter ''count'')'",
		КодыНативныхОшибок.ПотокВыходЗаГраницыБуфера(),
		"ru = 'Диапазон буфера выходит за допустимые границы';"
			+ "en = 'Buffer range is outside the allowed bounds'"
	);

КонецПроцедуры

Процедура ДобавитьПравилаJSON(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Источник данных JSON не открыт'; en = 'JSON data source is not opened'",
		"",
		КодыНативныхОшибок.JSONЧтениеНеОткрыто(),
		"ru = 'Недопустимое состояние объекта JSON'; en = 'Invalid JSON object state'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Приемник данных JSON не открыт'; en = 'JSON data target is not opened'",
		"",
		КодыНативныхОшибок.JSONЗаписьНеОткрыта(),
		"ru = 'Недопустимое состояние объекта JSON'; en = 'Invalid JSON object state'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Текущее значение JSON не может быть получено'; en = 'Cannot get current JSON value'",
		"",
		КодыНативныхОшибок.JSONТекущееЗначениеНедоступно(),
		"ru = 'Недопустимое состояние объекта JSON'; en = 'Invalid JSON object state'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Формат даты JavaScript не поддерживается.'; en = 'JavaScript date format is not supported'",
		"",
		КодыНативныхОшибок.JSONФорматДатыНеПоддерживается(),
		"ru = 'Формат даты JSON не поддерживается'; en = 'JSON date format is not supported'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Представление даты имеет неверный формат.';"
			+ "en = 'Invalid date presentation format'",
		"",
		КодыНативныхОшибок.JSONНекорректноеПредставлениеДаты(),
		"ru = 'Представление даты JSON имеет неверный формат';"
			+ "en = 'JSON date presentation has an invalid format'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Невозможно сохранить локальную дату в формате JavaScript';"
			+ "en = 'Cannot save local date in JavaScript format'",
		"",
		КодыНативныхОшибок.JSONЛокальнаяДатаНеПоддерживается(),
		"ru = 'Локальная дата не поддерживается форматом JSON';"
			+ "en = 'Local date is not supported by the JSON format'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Невозможно сохранить локальную дату в формате Microsoft';"
			+ "en = 'Cannot save local date in Microsoft format'",
		"",
		КодыНативныхОшибок.JSONЛокальнаяДатаНеПоддерживается(),
		"ru = 'Локальная дата не поддерживается форматом JSON';"
			+ "en = 'Local date is not supported by the JSON format'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Запись значения типа '; en = 'Cannot write value of type '",
		"ru = ' не поддерживается'; en = ''",
		КодыНативныхОшибок.JSONНеподдерживаемыйТипЗначения(),
		"ru = 'Тип значения не поддерживается ЗаписьюJSON';"
			+ "en = 'Value type is not supported by JSONWriter'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"ru = 'Недопустимое состояние потока чтения JSON в строке';"
			+ "en = 'Invalid JSON reader state at line'",
		"",
		КодыНативныхОшибок.JSONНекорректныйСинтаксис(),
		"ru = 'Некорректные данные JSON'; en = 'Invalid JSON data'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Непредвиденный символ при чтении JSON';"
			+ "en = 'Unexpected symbol during JSON reading'",
		"",
		КодыНативныхОшибок.JSONНекорректныйСинтаксис(),
		"ru = 'Некорректные данные JSON'; en = 'Invalid JSON data'"
	);

КонецПроцедуры

Процедура ДобавитьПравилаXML(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Приемник данных XML не открыт'; en = 'XML data target is not opened'",
		"",
		КодыНативныхОшибок.XMLЗаписьНеОткрыта(),
		"ru = 'ЗаписьXML не открыта'; en = 'XMLWriter is not open'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Ошибочный порядок записи XML'; en = 'Wrong order of XML record'",
		"",
		КодыНативныхОшибок.XMLНекорректноеСостояниеЗаписи(),
		"ru = 'Нарушен порядок операций записи XML'; en = 'Invalid order of XML writing operations'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Отсутствует системный идентификатор'; en = 'System ID missing'",
		"",
		КодыНативныхОшибок.XMLСистемныйИдентификаторНеЗадан(),
		"ru = 'Системный идентификатор XML-документа не задан'; en = 'XML document system ID is missing'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПоТипу(),
		"System.Xml.XmlException",
		"",
		"",
		КодыНативныхОшибок.XMLНекорректныйСинтаксис(),
		"ru = 'Некорректные данные XML'; en = 'Invalid XML data'"
	);

КонецПроцедуры

Процедура ДобавитьПравилаZIP(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Архив не открыт",
		"",
		КодыНативныхОшибок.АрхивНеОткрыт(),
		"ZIP-архив не открыт"
	);

КонецПроцедуры

Процедура ДобавитьПравилаТекста(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Файл не открыт'; en = 'File is not open'",
		"",
		КодыНативныхОшибок.ТекстовыйОбъектНеОткрыт(),
		"ru = 'Текстовый объект не открыт'; en = 'Text object is not open'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИФрагмент(),
		"System.NotSupportedException",
		"Явное указание кодировки в данной версии не поддерживается (только utf-8 согласно RFC 3986)",
		"",
		КодыНативныхОшибок.URLЯвнаяКодировкаНеПоддерживается(),
		"Явная кодировка URL не поддерживается"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"ru = 'Неправильное имя кодировки'; en = 'Invalid encoding name'",
		"",
		КодыНативныхОшибок.ТекстоваяКодировкаНеизвестна(),
		"ru = 'Неизвестная кодировка текста'; en = 'Unknown text encoding'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentException",
		"",
		"' is not a supported encoding name. For information on defining a custom encoding,"
			+ " see the documentation for the Encoding.RegisterProvider method. (Parameter 'name')",
		КодыНативныхОшибок.ТекстоваяКодировкаНеизвестна(),
		"ru = 'Неизвестная кодировка текста'; en = 'Unknown text encoding'"
	);

КонецПроцедуры

Процедура ДобавитьПравилаСтроковыхОпераций(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"ru = 'Ошибка синтаксиса шаблона в позиции '; en = 'Template syntax error at position '",
		"",
		КодыНативныхОшибок.СтроковыйШаблонНекорректныйСинтаксис(),
		"ru = 'Некорректный синтаксис строкового шаблона'; en = 'Invalid string template syntax'"
	);

КонецПроцедуры

Процедура ДобавитьПравилаДвоичныхДанных(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.FormatException",
		"",
		"ru = 'Неверный формат шестнадцатеричной строки'; en = 'Invalid hexadecimal string format'",
		КодыНативныхОшибок.ДвоичныеДанныеНекорректнаяHexСтрока(),
		"ru = 'Некорректные шестнадцатеричные данные'; en = 'Invalid hexadecimal data'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Буфер находится в режиме ""Только чтение""'; en = 'Buffer is read-only'",
		"",
		КодыНативныхОшибок.ДвоичныеДанныеТолькоДляЧтения(),
		"ru = 'Двоичный буфер доступен только для чтения'; en = 'Binary buffer is read-only'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.IndexOutOfRangeException",
		"",
		"ru = 'Переполнение при работе с буфером'; en = 'Buffer overflow'",
		КодыНативныхОшибок.ДвоичныеДанныеВыходЗаГраницыБуфера(),
		"ru = 'Операция выходит за границы двоичного буфера'; en = 'Operation exceeds binary buffer bounds'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentException",
		"",
		"ru = 'Исходный массив недостаточно длинный.';"
			+ "en = 'Source array was not long enough. Check the source index, length, "
			+ "and the array''s lower bounds. (Parameter ''sourceArray'')'",
		КодыНативныхОшибок.ДвоичныеДанныеВыходЗаГраницыБуфера(),
		"ru = 'Операция выходит за границы двоичного буфера'; en = 'Operation exceeds binary buffer bounds'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentException",
		"",
		"ru = 'Конечный массив недостаточно длинный.';"
			+ "en = 'Destination array was not long enough. Check the destination index, length, "
			+ "and the array''s lower bounds. (Parameter ''destinationArray'')'",
		КодыНативныхОшибок.ДвоичныеДанныеВыходЗаГраницыБуфера(),
		"ru = 'Операция выходит за границы двоичного буфера'; en = 'Operation exceeds binary buffer bounds'"
	);

КонецПроцедуры

Процедура ДобавитьПравилаОбъектов(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.NotSupportedException",
		"",
		"Specified method is not supported.",
		КодыНативныхОшибок.ОперацияНеПоддерживается(),
		"ru = 'Операция не поддерживается'; en = 'Operation is not supported'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"(null) Преобразование к типу '",
		" не поддерживается",
		КодыНативныхОшибок.ПреобразованиеТипаНеПоддерживается(),
		"Неподдерживаемое преобразование типа"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Преобразование к типу '''; en = 'Conversion to type '''",
		"ru = ' не поддерживается'; en = ' is not supported'",
		КодыНативныхОшибок.ПреобразованиеТипаНеПоддерживается(),
		"Неподдерживаемое преобразование типа"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Сравнение на больше/меньше для'",
		"ru = ' не поддерживается'",
		КодыНативныхОшибок.СравнениеНеПоддерживается(),
		"ru = 'Сравнение значений не поддерживается'; en = 'Value comparison is not supported'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"en = 'Greater-than/Less-than comparison operations are not supported'",
		"",
		КодыНативныхОшибок.СравнениеНеПоддерживается(),
		"ru = 'Сравнение значений не поддерживается'; en = 'Value comparison is not supported'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"OneScript.StandardLibrary.Collections.StructureImpl: Структура Преобразование к типу '",
		" не поддерживается",
		КодыНативныхОшибок.ПреобразованиеТипаНеПоддерживается(),
		"Неподдерживаемое преобразование типа"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"Метод объекта не обнаружен (",
		")",
		КодыНативныхОшибок.МетодОбъектаНеНайден(),
		"Метод объекта не найден"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Значение не является значением объектного типа",
		"",
		КодыНативныхОшибок.ТребуетсяОбъектноеЗначение(),
		"Требуется значение объектного типа"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Слишком много фактических параметров",
		"",
		КодыНативныхОшибок.СлишкомМногоАргументовВызова(),
		"Передано слишком много аргументов вызова"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Недостаточно фактических параметров",
		"",
		КодыНативныхОшибок.НедостаточноАргументовВызова(),
		"Передано недостаточно аргументов вызова"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"ru = 'Неверный тип аргумента '''; en = 'Invalid type of argument '''",
		"",
		КодыНативныхОшибок.НедопустимыйТипАргумента(),
		"ru = 'Недопустимый тип аргумента'; en = 'Invalid argument type'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Неверное значение аргумента'; en = 'Invalid argument value'",
		"",
		КодыНативныхОшибок.НедопустимоеЗначениеАргумента(),
		"ru = 'Недопустимое значение аргумента'; en = 'Invalid argument value'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксИФрагмент(),
		"",
		"ru = 'Ошибка при вызове метода контекста ('; en = 'Error calling context method ('",
		"",
		КодыНативныхОшибок.НедопустимоеЗначениеАргумента(),
		"ru = 'Недопустимое значение аргумента'; en = 'Invalid argument value'",
		"ru = '): Недопустимое значение параметра номер '''; en = '): Invalid parameter number '''"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"ru = 'Неверное значение аргумента '; en = 'Invalid argument value '",
		"",
		КодыНативныхОшибок.НедопустимоеЗначениеАргумента(),
		"ru = 'Недопустимое значение аргумента'; en = 'Invalid argument value'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"ru = 'Ошибка компиляции подключаемого сценария:'; en = 'Error compiling attached script:'",
		"",
		КодыНативныхОшибок.ОшибкаКомпиляцииСценария(),
		"ru = 'Ошибка компиляции сценария'; en = 'Script compilation failed'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"ru = 'Ошибка комиляции модуля'; en = 'Module compilation error'",
		"",
		КодыНативныхОшибок.ОшибкаКомпиляцииСценария(),
		"ru = 'Ошибка компиляции сценария'; en = 'Script compilation failed'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Неверный тип аргумента'; en = 'Invalid type of argument'",
		"",
		КодыНативныхОшибок.НедопустимыйТипАргумента(),
		"ru = 'Недопустимый тип аргумента'; en = 'Invalid argument type'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Задания завершились с ошибками'; en = 'Tasks are completed with errors'",
		"",
		КодыНативныхОшибок.ФоновыеЗадачиЗавершилисьСОшибками(),
		"ru = 'Фоновые задачи завершились с ошибками'; en = 'Background tasks failed'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"Тип не определен. Конструктор не найден (",
		")",
		КодыНативныхОшибок.КонструкторТипаНеНайден(),
		"Конструктор типа не найден"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentOutOfRangeException",
		"",
		"Year, Month, and Day parameters describe an un-representable DateTime.",
		КодыНативныхОшибок.НекорректныеКомпонентыДаты(),
		"Date components describe an un-representable DateTime"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Значение индекса выходит за пределы диапазона'; en = 'Index is out of range'",
		"",
		КодыНативныхОшибок.ИндексКоллекцииВнеДиапазона(),
		"ru = 'Индекс коллекции вне диапазона'; en = 'Collection index is out of range'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Значение, соответствующее ключу, не задано",
		"",
		КодыНативныхОшибок.КлючКоллекцииНеНайден(),
		"Значение по ключу коллекции не найдено"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Элемент не принадлежит списку значений'; en = 'Element does not belong to values list'",
		"",
		КодыНативныхОшибок.ЭлементНеПринадлежитКоллекции(),
		"ru = 'Элемент не принадлежит коллекции'; en = 'Element does not belong to collection'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Строка не принадлежит таблице значений'; en = 'Row does not belong to table'",
		"",
		КодыНативныхОшибок.ЭлементНеПринадлежитКоллекции(),
		"ru = 'Элемент не принадлежит коллекции'; en = 'Element does not belong to collection'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Индексированное значение доступно только для чтения",
		"",
		КодыНативныхОшибок.ИндексированноеЗначениеКоллекцииТолькоДляЧтения(),
		"Индексированное значение коллекции доступно только для чтения"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"В качестве параметра для конструктора можно передавать только ",
		" или Ключи и Значения",
		КодыНативныхОшибок.НекорректныйАргументКонструктораКоллекции(),
		"Некорректный аргумент конструктора коллекции"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Неправильное смещение внутри коллекции",
		"",
		КодыНативныхОшибок.ТаблицаНекорректноеСмещение(),
		"Некорректное смещение таблицы"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Неверное имя колонки '''; en = 'Wrong column name: '",
		"ru = ''''; en = ''",
		КодыНативныхОшибок.ТаблицаНекорректноеИмяКолонки(),
		"ru = 'Некорректное имя колонки таблицы'; en = 'Invalid table column name'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Колонка '; en = 'Column '",
		"ru = ' уже есть'; en = ' already exists'",
		КодыНативныхОшибок.ТаблицаКолонкаУжеСуществует(),
		"ru = 'Колонка таблицы уже существует'; en = 'Table column already exists'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Колонка '; en = 'Column '",
		"ru = ' колонкой суммирования'; en = ' summation column'",
		КодыНативныхОшибок.ТаблицаКонфликтРолейКолонки(),
		"ru = 'Конфликт роли колонки таблицы'; en = 'Table column role conflict'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Свойство объекта не обнаружено ('; en = 'Object property is not found ('",
		"ru = ')'; en = ')'",
		КодыНативныхОшибок.СвойствоОбъектаНеНайдено(),
		"ru = 'Свойство объекта не найдено'; en = 'Object property is not found'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		"ru = 'Свойство '; en = 'Property '",
		"ru = ' недоступно для записи'; en = ' is not writable'",
		КодыНативныхОшибок.СвойствоОбъектаНедоступноДляЗаписи(),
		"ru = 'Свойство объекта недоступно для записи'; en = 'Object property is not writable'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		"Задано неправильное имя атрибута структуры '",
		"",
		КодыНативныхОшибок.НекорректноеИмяСвойстваОбъекта(),
		"Некорректное имя свойства структуры"
	);

КонецПроцедуры

Процедура ДобавитьПравилаHTTP(Правила)

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"Защищенное соединение по произвольным сертификатам не поддерживается."
			+ " Если необходим доступ по https, просто укажите протокол https в адресе хоста.",
		"",
		КодыНативныхОшибок.HTTPПользовательскийСертификатНеПоддерживается(),
		"ru = 'Пользовательские TLS-сертификаты не поддерживаются';"
			+ "en = 'Custom TLS certificates are not supported'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.Net.WebException",
		"",
		"ru = 'Время ожидания операции истекло.'; en = 'The operation has timed out.'",
		КодыНативныхОшибок.HTTPТаймаутОперации(),
		"ru = 'Истекло время ожидания HTTP-операции'; en = 'HTTP operation timed out'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИФрагмент(),
		"System.Net.WebException",
		"failed with status code '407'",
		"",
		КодыНативныхОшибок.ПроксиТребуетАутентификации(),
		"ru = 'HTTPS-прокси требует аутентификацию'; en = 'HTTPS proxy authentication is required'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИФрагмент(),
		"System.Net.WebException",
		"The proxy tunnel request to proxy",
		"",
		КодыНативныхОшибок.ПроксиНеУстановилТуннель(),
		"ru = 'HTTPS-прокси не смог создать туннель'; en = 'HTTPS proxy failed to establish a tunnel'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.Net.WebException",
		"",
		"The SSL connection could not be established, see inner exception.",
		КодыНативныхОшибок.СетьОшибкаСогласованияTLS(),
		"ru = 'Не удалось установить защищенное TLS-соединение';"
			+ "en = 'Failed to establish a secure TLS connection'"
	);

	ДобавитьПравилаНекорректногоHTTPОтвета(Правила);

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.Net.Sockets.SocketException",
		"",
		"ru = 'Этот хост неизвестен.'; en = 'No such host is known.'",
		КодыНативныхОшибок.СетьОшибкаРазрешенияИмениУзла(),
		"ru = 'Не удалось разрешить имя сетевого узла'; en = 'Network host name resolution failed'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.Sockets.SocketException",
		"ru = 'Подключение не установлено, т.к. конечный компьютер отверг запрос на подключение.';"
			+ "en = 'No connection could be made because the target machine actively refused it.'",
		"ru = ''; en = ''",
		КодыНативныхОшибок.СетьСоединениеОтклонено(),
		"ru = 'Сетевое соединение отклонено'; en = 'Network connection was refused'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.Net.Sockets.SocketException",
		"",
		"ru = 'Удаленный хост принудительно разорвал существующее подключение.';"
			+ "en = 'An existing connection was forcibly closed by the remote host.'",
		КодыНативныхОшибок.СетьСоединениеСброшено(),
		"ru = 'Сетевое соединение сброшено удаленным узлом';"
			+ "en = 'Network connection was reset by the remote host'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.Http.HttpIOException",
		"The response ended prematurely, with at least",
		"(ResponseEnded)",
		КодыНативныхОшибок.HTTPНеполныйОтвет(),
		"ru = 'Тело HTTP-ответа получено не полностью'; en = 'HTTP response body was incomplete'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.Net.Http.HttpIOException",
		"",
		"The response ended prematurely. (ResponseEnded)",
		КодыНативныхОшибок.HTTPНеполныйОтвет(),
		"ru = 'Тело HTTP-ответа получено не полностью'; en = 'HTTP response body was incomplete'"
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentException",
		"",
		"Cannot set null or blank methods on request. (Parameter 'value')",
		КодыНативныхОшибок.HTTPНекорректныйМетод(),
		"ru = 'Некорректный HTTP-метод'; en = 'Invalid HTTP method'"
	);

	ДобавитьПравилаHTTPЗаголовков(Правила);

КонецПроцедуры

Процедура ДобавитьПравилаНекорректногоHTTPОтвета(Правила)

	КодОшибки = КодыНативныхОшибок.HTTPНекорректныйОтвет();
	Сообщение = "ru = 'Получен некорректный HTTP-ответ'; en = 'Invalid HTTP response received'";

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.WebException",
		"Received an invalid status line:",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.WebException",
		"Received an invalid status code:",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.WebException",
		"Received an invalid header name:",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.WebException",
		"Received an invalid header line:",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.Http.HttpIOException",
		"Received chunk header length could not be parsed:",
		"(InvalidResponse)",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		"System.Net.Http.HttpIOException",
		"Received an invalid chunk terminator:",
		"(InvalidResponse)",
		КодОшибки,
		Сообщение
	);

КонецПроцедуры

Процедура ДобавитьПравилаHTTPЗаголовков(Правила)

	КодОшибки = КодыНативныхОшибок.HTTPНекорректныйЗаголовок();
	Сообщение = "ru = 'Некорректный HTTP-заголовок'; en = 'Invalid HTTP header'";

	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Заголовок Content-Length задан неправильно'; en = 'Header Content-Length is invalid'",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Заголовок Date задан неправильно'; en = 'Header Date is invalid'",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Заголовок If-Modified-Since задан неправильно'; en = 'Header If-Modified-Since is invalid'",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		"ru = 'Заголовок Range задан неправильно'; en = 'Header Range is invalid'",
		"",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentException",
		"",
		"Chunked encoding must be set via the SendChunked property. (Parameter 'value')",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentException",
		"",
		"Keep-Alive and Close may not be set using this property. (Parameter 'value')",
		КодОшибки,
		Сообщение
	);
	ДобавитьПравило(
		Правила,
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		"System.ArgumentException",
		"",
		"The specified value is not a valid Host header string. (Parameter 'value')",
		КодОшибки,
		Сообщение
	);

КонецПроцедуры

Процедура ДобавитьПравило(
	Правила,
	Способ,
	НативныйТип,
	Начало,
	Окончание,
	КодОшибки,
	Сообщение,
	Фрагмент = "")

	ШаблонСообщения = "";
	Префикс = "";
	Если Способ = СпособыСопоставленияНативныхОшибок.Точное() Тогда
		ШаблонСообщения = Начало;
	ИначеЕсли Способ = СпособыСопоставленияНативныхОшибок.Префикс()
		Или Способ = СпособыСопоставленияНативныхОшибок.ПрефиксОкончание()
		Или Способ = СпособыСопоставленияНативныхОшибок.ПрефиксИФрагмент() Тогда
		Префикс = Начало;
	ИначеЕсли Способ = СпособыСопоставленияНативныхОшибок.ТипИФрагмент()
		Или Способ = СпособыСопоставленияНативныхОшибок.ТипИОбрамление() Тогда
		Фрагмент = Начало;
	КонецЕсли;

	Правило = Новый ПравилоКлассификацииНативныхОшибок(
		Способ,
		КодОшибки,
		Сообщение,
		НативныйТип,
		ШаблонСообщения,
		Префикс,
		Фрагмент,
		Окончание
	);

	Правила.Добавить(Правило);

КонецПроцедуры

#КонецОбласти
