#Использовать asserts
#Использовать "../src"

#Область Тесты

&Тест
Процедура ТестДолжен_СоздаватьПравилаДляВсехСпособовСопоставления() Экспорт

	// Подготовка
	КодОшибки = "application.failure";
	Сообщение = "Ошибка приложения";
	НативныйТип = "System.Exception";
	ШаблонСообщения = "Текст ошибки";
	ШаблонОкончания = "Окончание ошибки";

	// Действие и Проверка
	ПроверитьПравило(
		ФабрикаПравилНативныхОшибок.Точное(ШаблонСообщения, КодОшибки, Сообщение),
		СпособыСопоставленияНативныхОшибок.Точное(),
		"",
		ШаблонСообщения,
		"",
		КодОшибки,
		Сообщение
	);
	ПроверитьПравило(
		ФабрикаПравилНативныхОшибок.Префикс(ШаблонСообщения, КодОшибки, Сообщение),
		СпособыСопоставленияНативныхОшибок.Префикс(),
		"",
		ШаблонСообщения,
		"",
		КодОшибки,
		Сообщение
	);
	ПроверитьПравило(
		ФабрикаПравилНативныхОшибок.ПрефиксОкончание(
			ШаблонСообщения,
			ШаблонОкончания,
			КодОшибки,
			Сообщение
		),
		СпособыСопоставленияНативныхОшибок.ПрефиксОкончание(),
		"",
		ШаблонСообщения,
		ШаблонОкончания,
		КодОшибки,
		Сообщение
	);
	ПроверитьПравило(
		ФабрикаПравилНативныхОшибок.ПоТипу(НативныйТип, КодОшибки, Сообщение),
		СпособыСопоставленияНативныхОшибок.ПоТипу(),
		НативныйТип,
		"",
		"",
		КодОшибки,
		Сообщение
	);
	ПроверитьПравило(
		ФабрикаПравилНативныхОшибок.ТипИОкончание(
			НативныйТип,
			ШаблонОкончания,
			КодОшибки,
			Сообщение
		),
		СпособыСопоставленияНативныхОшибок.ТипИОкончание(),
		НативныйТип,
		"",
		ШаблонОкончания,
		КодОшибки,
		Сообщение
	);
	ПроверитьПравило(
		ФабрикаПравилНативныхОшибок.ТипИФрагмент(
			НативныйТип,
			ШаблонСообщения,
			КодОшибки,
			Сообщение
		),
		СпособыСопоставленияНативныхОшибок.ТипИФрагмент(),
		НативныйТип,
		ШаблонСообщения,
		"",
		КодОшибки,
		Сообщение
	);
	ПроверитьПравило(
		ФабрикаПравилНативныхОшибок.ТипИОбрамление(
			НативныйТип,
			ШаблонСообщения,
			ШаблонОкончания,
			КодОшибки,
			Сообщение
		),
		СпособыСопоставленияНативныхОшибок.ТипИОбрамление(),
		НативныйТип,
		ШаблонСообщения,
		ШаблонОкончания,
		КодОшибки,
		Сообщение
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПравило(
	Правило,
	Способ,
	НативныйТип,
	Начало,
	Окончание,
	КодОшибки,
	Сообщение)

	Ожидаем.Что(Правило).ИмеетТип("ПравилоКлассификацииНативныхОшибок");
	Ожидаем.Что(Правило.Способ).Равно(Способ);
	Ожидаем.Что(Правило.НативныйТип).Равно(НативныйТип);
	Ожидаем.Что(Правило.Начало).Равно(Начало);
	Ожидаем.Что(Правило.Окончание).Равно(Окончание);
	Ожидаем.Что(Правило.КодОшибки).Равно(КодОшибки);
	Ожидаем.Что(Правило.Сообщение).Равно(Сообщение);

КонецПроцедуры

#КонецОбласти
