#Использовать asserts
#Использовать errors
#Использовать "../src"
#Использовать "./internal"

Перем _Проброс; // ТестовыйПробросПодробногоПредставления

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми() Экспорт

	_Проброс = Новый ТестовыйПробросПодробногоПредставления;

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьЧтениеJSONДоОткрытия() Экспорт
	
	// Действие и Проверка
	Попытка
		Чтение = Новый ЧтениеJSON;
		Результат = Чтение.Прочитать();
	Исключение
		ИсходнаяОшибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.JSONЧтениеНеОткрыто()
	);
КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьЗаписьJSONДоОткрытия() Экспорт
	
	// Действие и Проверка
	Попытка
		Запись = Новый ЗаписьJSON;
		Запись.ЗаписатьНачалоОбъекта();
	Исключение
		ИсходнаяОшибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.JSONЗаписьНеОткрыта()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьНедоступноеТекущееЗначениеJSON() Экспорт
	
	// Действие и Проверка
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку("{}");
		Значение = Чтение.ТекущееЗначение;
	Исключение
		ИсходнаяОшибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.JSONТекущееЗначениеНедоступно()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьНекорректныйJSON() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуНекорректногоJSON();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.JSONНекорректныйСинтаксис()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьНеподдерживаемыйТипЗначенияJSON() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуНеподдерживаемогоТипаJSON();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.JSONНеподдерживаемыйТипЗначения()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьЗаписьJSONВПотокТолькоДляЧтения() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуПотокаБезПоддержкиЗаписи();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокНеПоддерживаетЗапись()
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОшибкуНекорректногоJSON()

	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку("{ ""field"": }");
		ПрочитатьJSON(Чтение);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка чтения JSON не возникла";

КонецФункции

Функция ПолучитьОшибкуНеподдерживаемогоТипаJSON()

	Попытка
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьЗначение(Новый Массив);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка неподдерживаемого типа JSON не возникла";

КонецФункции

Функция ПолучитьОшибкуПотокаБезПоддержкиЗаписи()

	Попытка
		Поток = Новый ПотокВПамяти;
		ПотокТолькоДляЧтения = Поток.ПолучитьПотокТолькоДляЧтения();
		Запись = Новый ЗаписьJSON;
		Запись.ОткрытьПоток(ПотокТолькоДляЧтения);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка потока без поддержки записи не возникла";

КонецФункции

#КонецОбласти
