#Использовать errors
#Использовать "../src"
#Использовать "./internal"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьАннотированныеИсточникиОшибок() Экспорт

	// Действие и Проверка
	МатрицаИсточниковОшибок.Проверить(ЭтотОбъект, 4);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ОжидаемыйКодОшибки("НедопустимоеЗначениеАргумента")
Функция ПолучитьОшибкуНедопустимогоДиапазонаСлучайногоЧисла() Экспорт

	Попытка
		Генератор = Новый ГенераторСлучайныхЧисел;
		Результат = Генератор.СлучайноеЧисло(10, 1);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка недопустимого диапазона случайного числа не возникла";

КонецФункции

&ОжидаемыйКодОшибки("НедопустимоеЗначениеАргумента")
Функция ПолучитьОшибкуНекорректногоСмещенияЧасовогоПояса() Экспорт

	Попытка
		Представление = ПредставлениеЧасовогоПояса("GMT+444");
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка некорректного смещения часового пояса не возникла";

КонецФункции

&ОжидаемыйКодОшибки("НедопустимоеЗначениеАргумента")
Функция ПолучитьОшибкуПустогоШаблонаПоискаНачалаСтроки() Экспорт

	Попытка
		Результат = СтрНачинаетсяС("Строка", "");
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка пустого шаблона поиска начала строки не возникла";

КонецФункции

&ОжидаемыйКодОшибки("НедопустимоеЗначениеАргумента")
Функция ПолучитьОшибкуПустогоШаблонаПоискаОкончанияСтроки() Экспорт

	Попытка
		Результат = СтрЗаканчиваетсяНа("Строка", "");
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка пустого шаблона поиска окончания строки не возникла";

КонецФункции

#КонецОбласти
