#Использовать asserts
#Использовать errors
#Использовать "../src"
#Использовать "./internal"

Перем _Проброс; // ТестовыйПробросПодробногоПредставления

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми() Экспорт

	_Проброс = Новый ТестовыйПробросПодробногоПредставления;

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьЗаписьXMLДоОткрытия() Экспорт

	// Действие и Проверка
	Попытка
		Запись = Новый ЗаписьXML;
		Запись.ЗаписатьНачалоЭлемента("root");
	Исключение
		ИсходнаяОшибка = ИнформацияОбОшибке();
	КонецПопытки;

	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.XMLЗаписьНеОткрыта()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьНекорректныйXML() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуНекорректногоXML();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.XMLНекорректныйСинтаксис()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьОшибочныйПорядокЗаписиXML() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуПорядкаЗаписиXML();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.XMLНекорректноеСостояниеЗаписи()
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОшибкуНекорректногоXML()

	Попытка
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку("<root><child></root>");
		Пока Чтение.Прочитать() Цикл
		КонецЦикла;
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка чтения XML не возникла";

КонецФункции

Функция ПолучитьОшибкуПорядкаЗаписиXML()

	Попытка
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьНачалоЭлемента("a");
		Запись.ЗаписатьТипДокумента("A", "B");
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка порядка записи XML не возникла";

КонецФункции

#КонецОбласти
