#Использовать errors
#Использовать "../src"
#Использовать "./internal"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

#КонецОбласти

#Область Тесты

&ПараметризованныйТест
&ИсточникВыражение("() -> ПараметрыИсточниковОшибок()")
Процедура ТестДолжен_КлассифицироватьИсточникОшибки(ИдентификаторПравила, ИмяИсточника) Экспорт

	МатрицаИсточниковОшибок.ПроверитьИсточник(ЭтотОбъект, ИмяИсточника);

КонецПроцедуры

Функция ПараметрыИсточниковОшибок() Экспорт

	Возврат МатрицаИсточниковОшибок.ПараметрыИсточников(ЭтотОбъект, 1);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ОжидаемыйКодОшибки("НедопустимоеЗначениеАргумента")
&ОжидаемоеПравилоОшибки("argument.invalid_value.non_negative")
Функция ПолучитьОшибкуОтрицательнойДлиныКвалификатораСтроки() Экспорт

	Попытка
		Квалификатор = Новый КвалификаторыСтроки(-1);
		Описание = Новый ОписаниеТипов("Строка", , Квалификатор);
		Описание.ПривестиЗначение("Строка");
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка отрицательной длины квалификатора строки не возникла";

КонецФункции

#КонецОбласти
