#Использовать asserts
#Использовать errors
#Использовать "../src"
#Использовать "./internal"

Перем _Проброс; // ТестовыйПробросПодробногоПредставления

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми() Экспорт

	_Проброс = Новый ТестовыйПробросПодробногоПредставления;

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьНеизвестнуюКодировку() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуНеизвестнойКодировки();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.ТекстНеизвестнаяКодировка()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьЧтениеДоОткрытия() Экспорт

	// Действие и Проверка
	Попытка
		Чтение = Новый ЧтениеТекста;
		Результат = Чтение.Прочитать();
	Исключение
		ИсходнаяОшибка = ИнформацияОбОшибке();
	КонецПопытки;

	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.ТекстНеОткрыт()
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОшибкуНеизвестнойКодировки()

	Попытка
		Чтение = Новый ЧтениеТекста(ТекущийСценарий().Источник, "X-NATIVE-ERRORS-UNKNOWN");
		Чтение.Прочитать();
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка неизвестной кодировки не возникла";

КонецФункции

#КонецОбласти
