#Использовать errors
#Использовать "../src"
#Использовать "./internal"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьАннотированныеИсточникиОшибок() Экспорт

	// Действие и Проверка
	МатрицаИсточниковОшибок.Проверить(ЭтотОбъект, 1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ОжидаемыйКодОшибки("COMПолучениеАктивногоОбъектаНеПоддерживается")
Функция ПолучитьОшибкуПолученияАктивногоCOMОбъекта() Экспорт

	Попытка
		ПолучитьCOMОбъект(Неопределено, "Scripting.Dictionary");
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка получения активного COM-объекта не возникла";

КонецФункции

#КонецОбласти
