#Использовать asserts
#Использовать "../src"

#Область Тесты

&Тест
Процедура ТестДолжен_ОставитьОдинПубличныйКлассификатор() Экспорт

	// Подготовка
	ИменаТочечныхМодулей = Новый Массив;
	ИменаТочечныхМодулей.Добавить("КлассификаторОшибокФайловойСистемы.os");
	ИменаТочечныхМодулей.Добавить("КлассификаторОшибокJSON.os");
	ИменаТочечныхМодулей.Добавить("КлассификаторОшибокXML.os");
	ИменаТочечныхМодулей.Добавить("КлассификаторОшибокТекста.os");
	ИменаТочечныхМодулей.Добавить("КлассификаторОшибокПотоков.os");
	ИменаТочечныхМодулей.Добавить("КлассификаторОшибокДвоичныхДанных.os");
	ИменаТочечныхМодулей.Добавить("КлассификаторОшибокHTTP.os");

	// Действие и Проверка
	Для Каждого ИмяМодуля Из ИменаТочечныхМодулей Цикл
		Путь = ОбъединитьПути(ТекущийКаталог(), "src", "Модули", ИмяМодуля);
		Ожидаем.Что(Новый Файл(Путь).Существует()).ЭтоЛожь();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
