#Использовать asserts
#Использовать "../src"
#Использовать "./internal"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ВозвращатьСвободныйTCPПорт() Экспорт

	// Подготовка
	Порт = ТестовыеСетевыеФикстуры.ПолучитьСвободныйПорт();
	Сервер = Новый TCPСервер(Порт);

	// Действие
	Сервер.Запустить();

	// Проверка
	Ожидаем.Что(Порт).Больше(0);

	Сервер.Остановить();

КонецПроцедуры

#КонецОбласти
