#Использовать asserts
#Использовать "../src"

#Область Тесты

&Тест
Процедура ТестДолжен_ВозвращатьУникальныеСпособыСопоставления() Экспорт

	// Подготовка
	Способы = Новый Массив;
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.Точное());
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.Префикс());
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.ПрефиксОкончание());
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.ПрефиксИФрагмент());
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.ПоТипу());
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.ТипИОкончание());
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.ТипИФрагмент());
	Способы.Добавить(СпособыСопоставленияНативныхОшибок.ТипИОбрамление());
	УникальныеСпособы = Новый Соответствие;

	// Действие
	Для Каждого Способ Из Способы Цикл
		УникальныеСпособы.Вставить(Способ, Истина);
	КонецЦикла;

	// Проверка
	Ожидаем.Что(УникальныеСпособы.Количество()).Равно(Способы.Количество());

КонецПроцедуры

#КонецОбласти
