#Использовать errors
#Использовать "../src"
#Использовать "./internal"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

#КонецОбласти

#Область Тесты

&ПараметризованныйТест
&ИсточникВыражение("() -> ПараметрыИсточниковОшибок()")
Процедура ТестДолжен_КлассифицироватьИсточникОшибки(ИдентификаторПравила, ИмяИсточника) Экспорт

	МатрицаИсточниковОшибок.ПроверитьИсточник(ЭтотОбъект, ИмяИсточника);

КонецПроцедуры

Функция ПараметрыИсточниковОшибок() Экспорт

	Возврат МатрицаИсточниковОшибок.ПараметрыИсточников(ЭтотОбъект, 1);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ВключенДляOneScript(">=2.1.0")
&ОжидаемыйКодОшибки("ОшибкаКомпиляцииСценария")
&ОжидаемоеПравилоОшибки("compilation.module")
Функция ПолучитьОшибкуКомпиляцииФрагмента() Экспорт

	Попытка
		Фрагмент = Новый СкомпилированныйФрагмент;
		Фрагмент.ФрагментКода = "?";
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка компиляции фрагмента не возникла";

КонецФункции

#КонецОбласти
