#Использовать asserts
#Использовать errors
#Использовать "../src"
#Использовать "./internal"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьАннотированныеИсточникиОшибок() Экспорт

	// Действие и Проверка
	МатрицаИсточниковОшибок.Проверить(ЭтотОбъект, 1);

КонецПроцедуры

&Тест
Процедура ТестНеДолжен_КлассифицироватьОшибкуСозданияОбычногоОбъекта() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуССообщением("Не удалось создать объект `Заказ`");

	// Действие и Проверка
	ТестовыйПробросПодробногоПредставления.ПроверитьНеклассифицированностьВариантами(
		ИсходнаяОшибка
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ОжидаемыйКодОшибки("ВнешняяКомпонентаНекорректныйФормат")
Функция ПолучитьОшибкуНекорректногоФорматаВнешнейКомпоненты() Экспорт

	Попытка
		ПодключитьВнешнююКомпоненту(ТекущийСценарий().Источник);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка формата внешней компоненты не возникла";

КонецФункции

Функция ПолучитьОшибкуССообщением(Сообщение)

	Попытка
		ВызватьИсключение Сообщение;
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

КонецФункции

#КонецОбласти
