#Использовать asserts
#Использовать errors
#Использовать "../src"
#Использовать "./internal"

Перем _Проброс; // ТестовыйПробросПодробногоПредставления

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми() Экспорт

	_Проброс = Новый ТестовыйПробросПодробногоПредставления;

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьОперациюСЗакрытымПотоком() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуЗакрытогоПотока();

	// Действие
	НормализованнаяОшибка = Новый КлассификаторНативныхОшибок.Классифицировать(ИсходнаяОшибка);

	// Проверка
	Ожидаем.Что(НормализованнаяОшибка).ИмеетТип("ИнформацияОбОшибке");
	Ожидаем.Что(ДиагностикаОшибок.КодОшибки(НормализованнаяОшибка))
		.Равно(КодыНативныхОшибок.ПотокЗакрыт());
	Ожидаем.Что(НормализованнаяОшибка.Причина).Идентично(ИсходнаяОшибка);
	Проброс = _Проброс;
	Проброс.ПроверитьКодВариантами(Новый КлассификаторНативныхОшибок, ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокЗакрыт());

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьНеверныйДиапазонБуфераПриЗаписиВПоток() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуНеверногоДиапазонаБуфера();

	// Действие
	НормализованнаяОшибка = Новый КлассификаторНативныхОшибок.Классифицировать(ИсходнаяОшибка);

	// Проверка
	Ожидаем.Что(НормализованнаяОшибка).ИмеетТип("ИнформацияОбОшибке");
	Ожидаем.Что(ДиагностикаОшибок.КодОшибки(НормализованнаяОшибка))
		.Равно(КодыНативныхОшибок.ПотокВыходЗаГраницыБуфера());
	Ожидаем.Что(НормализованнаяОшибка.Причина).Идентично(ИсходнаяОшибка);
	Проброс = _Проброс;
	Проброс.ПроверитьКодВариантами(Новый КлассификаторНативныхОшибок, ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокВыходЗаГраницыБуфера());

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьЗаписьВПотокТолькоДляЧтения() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуЗаписиВПотокТолькоДляЧтения();

	// Действие
	НормализованнаяОшибка = Новый КлассификаторНативныхОшибок.Классифицировать(ИсходнаяОшибка);

	// Проверка
	Ожидаем.Что(НормализованнаяОшибка).ИмеетТип("ИнформацияОбОшибке");
	Ожидаем.Что(ДиагностикаОшибок.КодОшибки(НормализованнаяОшибка))
		.Равно(КодыНативныхОшибок.ПотокНеПоддерживаетЗапись());
	Ожидаем.Что(НормализованнаяОшибка.Причина).Идентично(ИсходнаяОшибка);
	Проброс = _Проброс;
	Проброс.ПроверитьКодВариантами(Новый КлассификаторНативныхОшибок, ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокНеПоддерживаетЗапись());

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьЗаписьТекстаВЗакрытыйПоток() Экспорт

	// Действие
	Попытка
		Поток = Новый ПотокВПамяти;
		Поток.Закрыть();
		Запись = Новый ЗаписьТекста(Поток);
		Запись.Записать("text");
	Исключение
		ИсходнаяОшибка = ИнформацияОбОшибке();
	КонецПопытки;

	НормализованнаяОшибка = Новый КлассификаторНативныхОшибок.Классифицировать(ИсходнаяОшибка);

	// Проверка
	Ожидаем.Что(НормализованнаяОшибка).ИмеетТип("ИнформацияОбОшибке");
	Ожидаем.Что(ДиагностикаОшибок.КодОшибки(НормализованнаяОшибка))
		.Равно(КодыНативныхОшибок.ПотокЗакрыт());
	Ожидаем.Что(НормализованнаяОшибка.Причина).Идентично(ИсходнаяОшибка);
	Проброс = _Проброс;
	Проброс.ПроверитьКодВариантами(Новый КлассификаторНативныхОшибок, ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокЗакрыт());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОшибкуЗакрытогоПотока()

	Попытка
		Поток = Новый ПотокВПамяти;
		Поток.Закрыть();
		Поток.Записать(Новый БуферДвоичныхДанных(1), 0, 1);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка закрытого потока не возникла";

КонецФункции

Функция ПолучитьОшибкуНеверногоДиапазонаБуфера()

	Попытка
		Поток = Новый ПотокВПамяти;
		Поток.Записать(Новый БуферДвоичныхДанных(2), 1, 2);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка неверного диапазона буфера не возникла";

КонецФункции

Функция ПолучитьОшибкуЗаписиВПотокТолькоДляЧтения()

	Попытка
		Поток = Новый ПотокВПамяти;
		ПотокТолькоДляЧтения = Поток.ПолучитьПотокТолькоДляЧтения();
		ПотокТолькоДляЧтения.Записать(Новый БуферДвоичныхДанных(1), 0, 1);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка записи в поток только для чтения не возникла";

КонецФункции

#КонецОбласти
