#Использовать asserts
#Использовать errors
#Использовать "../src"
#Использовать "./internal"

Перем _Проброс; // ТестовыйПробросПодробногоПредставления

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми() Экспорт

	_Проброс = Новый ТестовыйПробросПодробногоПредставления;

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьОперациюСЗакрытымПотоком() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуЗакрытогоПотока();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокЗакрыт()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьНеверныйДиапазонБуфераПриЗаписиВПоток() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуНеверногоДиапазонаБуфера();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокВыходЗаГраницыБуфера()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьЗаписьВПотокТолькоДляЧтения() Экспорт

	// Подготовка
	ИсходнаяОшибка = ПолучитьОшибкуЗаписиВПотокТолькоДляЧтения();

	// Действие и Проверка
	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокНеПоддерживаетЗапись()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КлассифицироватьЗаписьТекстаВЗакрытыйПоток() Экспорт

	// Действие и Проверка
	Попытка
		Поток = Новый ПотокВПамяти;
		Поток.Закрыть();
		Запись = Новый ЗаписьТекста(Поток);
		Запись.Записать("text");
	Исключение
		ИсходнаяОшибка = ИнформацияОбОшибке();
	КонецПопытки;

	_Проброс.ПроверитьКодВариантами(
		ИсходнаяОшибка,
		КодыНативныхОшибок.ПотокЗакрыт()
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОшибкуЗакрытогоПотока()

	Попытка
		Поток = Новый ПотокВПамяти;
		Поток.Закрыть();
		Поток.Записать(Новый БуферДвоичныхДанных(1), 0, 1);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка закрытого потока не возникла";

КонецФункции

Функция ПолучитьОшибкуНеверногоДиапазонаБуфера()

	Попытка
		Поток = Новый ПотокВПамяти;
		Поток.Записать(Новый БуферДвоичныхДанных(2), 1, 2);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка неверного диапазона буфера не возникла";

КонецФункции

Функция ПолучитьОшибкуЗаписиВПотокТолькоДляЧтения()

	Попытка
		Поток = Новый ПотокВПамяти;
		ПотокТолькоДляЧтения = Поток.ПолучитьПотокТолькоДляЧтения();
		ПотокТолькоДляЧтения.Записать(Новый БуферДвоичныхДанных(1), 0, 1);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка записи в поток только для чтения не возникла";

КонецФункции

#КонецОбласти
