#Использовать errors
#Использовать "../src"
#Использовать "./internal"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_КлассифицироватьАннотированныеИсточникиОшибок() Экспорт

	// Действие и Проверка
	МатрицаИсточниковОшибок.Проверить(ЭтотОбъект, 1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ВключенДляOneScript(">=2.1.0")
&ОжидаемыйКодОшибки("ОшибкаКомпиляцииСценария")
&ОжидаемоеПравилоОшибки("compilation.module")
Функция ПолучитьОшибкуКомпиляцииФрагмента() Экспорт

	Попытка
		Фрагмент = Новый СкомпилированныйФрагмент;
		Фрагмент.ФрагментКода = "?";
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	ВызватьИсключение "Ожидаемая ошибка компиляции фрагмента не возникла";

КонецФункции

#КонецОбласти
