#Использовать asserts
#Использовать annotations

#Область ПрограммныйИнтерфейс

Процедура Проверить(Контекст, ОжидаемоеКоличество) Экспорт

	Рефлектор = Новый Рефлектор;
	Методы = РаботаСАннотациями.НайтиМетодыСАннотацией(
		Рефлектор.ПолучитьТаблицуМетодов(Контекст),
		"ОжидаемыйКодОшибки"
	);
	Ожидаем.Что(Методы.Количество()).Равно(ОжидаемоеКоличество);

	Для Каждого Метод Из Методы Цикл
		Аннотация = РаботаСАннотациями.ПолучитьАннотацию(Метод, "ОжидаемыйКодОшибки");
		ИмяМетодаКода = РаботаСАннотациями.ПолучитьЗначениеПараметраАннотации(Аннотация);
		КодОшибки = Рефлектор.ВызватьМетод(
			КодыНативныхОшибок,
			ИмяМетодаКода,
			Новый Массив
		);
		ИсходнаяОшибка = Рефлектор.ВызватьМетод(Контекст, Метод.Имя, Новый Массив);
		НеопределяемаяОбёртка = РаботаСАннотациями.ПолучитьЗначениеПараметраАннотации(
			Аннотация,
			"НеопределяемаяОбёртка",
			Ложь
		);

		Если НеопределяемаяОбёртка Тогда
			ТестовыйПробросПодробногоПредставления.ПроверитьКодСНеопределяемойОбёрткой(
				ИсходнаяОшибка,
				КодОшибки
			);
		Иначе
			ПроверитьКодВариантами(ИсходнаяОшибка, КодОшибки, Метод.Имя);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьКодВариантами(ИсходнаяОшибка, КодОшибки, ИмяМетода)

	Попытка
		ТестовыйПробросПодробногоПредставления.ПроверитьКодВариантами(
			ИсходнаяОшибка,
			КодОшибки
		);
	Исключение
		ВызватьИсключение СтрШаблон(
			"Не классифицирован источник ошибки %1: %2",
			ИмяМетода,
			ИсходнаяОшибка.Описание
		);
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
