#Использовать asserts
#Использовать annotations

#Область ПрограммныйИнтерфейс

Процедура Проверить(Контекст, ОжидаемоеКоличество) Экспорт

	Рефлектор = Новый Рефлектор;
	Методы = РаботаСАннотациями.НайтиМетодыСАннотацией(
		Рефлектор.ПолучитьТаблицуМетодов(Контекст),
		"ОжидаемыйКодОшибки"
	);
	Ожидаем.Что(Методы.Количество()).Равно(ОжидаемоеКоличество);

	Для Каждого Метод Из Методы Цикл
		Аннотация = РаботаСАннотациями.ПолучитьАннотацию(Метод, "ОжидаемыйКодОшибки");
		ИмяМетодаКода = РаботаСАннотациями.ПолучитьЗначениеПараметраАннотации(Аннотация);
		КодОшибки = Рефлектор.ВызватьМетод(
			КодыНативныхОшибок,
			ИмяМетодаКода,
			Новый Массив
		);
		ИсходнаяОшибка = Рефлектор.ВызватьМетод(Контекст, Метод.Имя, Новый Массив);
		ТестовыйПробросПодробногоПредставления.ПроверитьКодВариантами(
			ИсходнаяОшибка,
			КодОшибки
		);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
