#Использовать asserts
#Использовать errors

#Область ПрограммныйИнтерфейс

Функция ПолучитьОбернутуюОшибку(Ошибка) Экспорт

	Попытка
		ВызватьИсключение ПодробноеПредставлениеОшибки(Ошибка);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

КонецФункции

Процедура ПроверитьКодВариантами(ИсходнаяОшибка, ОжидаемыйКод) Экспорт

	ПроверитьКод(ИсходнаяОшибка, ОжидаемыйКод);

	ОбернутаяОшибка = ПолучитьОбернутуюОшибку(ИсходнаяОшибка);
	ПроверитьКод(ОбернутаяОшибка, ОжидаемыйКод);

КонецПроцедуры

Процедура ПроверитьКодСНеопределяемойОберткой(ИсходнаяОшибка, ОжидаемыйКод) Экспорт

	ПроверитьКод(ИсходнаяОшибка, ОжидаемыйКод);

	ОбернутаяОшибка = ПолучитьОбернутуюОшибку(ИсходнаяОшибка);
	ПроверитьНеклассифицированность(ОбернутаяОшибка);

КонецПроцедуры

Процедура ПроверитьНеклассифицированностьВариантами(ИсходнаяОшибка) Экспорт

	ПроверитьНеклассифицированность(ИсходнаяОшибка);

	ОбернутаяОшибка = ПолучитьОбернутуюОшибку(ИсходнаяОшибка);
	ПроверитьНеклассифицированность(ОбернутаяОшибка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйИнтерфейс

Процедура ПроверитьКод(ПроверяемаяОшибка, ОжидаемыйКод)

	Классификатор = Новый КлассификаторОшибок;
	Классификатор.ДобавитьПоставщикаПравил(Тип("ПравилаНативныхОшибок"));

	НормализованнаяОшибка = Классификатор.Классифицировать(ПроверяемаяОшибка);
	Ожидаем.Что(НормализованнаяОшибка).ИмеетТип("ИнформацияОбОшибке");

	Снимок = Новый СнимокКадраОшибки(НормализованнаяОшибка);
	Ожидаем.Что(Снимок.КодОшибки()).Равно(ОжидаемыйКод);
	Ожидаем.Что(НормализованнаяОшибка.Причина).Идентично(ПроверяемаяОшибка);

КонецПроцедуры

Процедура ПроверитьНеклассифицированность(ПроверяемаяОшибка)

	Классификатор = Новый КлассификаторОшибок;
	Классификатор.ДобавитьПоставщикаПравил(Тип("ПравилаНативныхОшибок"));

	НормализованнаяОшибка = Классификатор.Классифицировать(ПроверяемаяОшибка);
	Ожидаем.Что(НормализованнаяОшибка).Идентично(Неопределено);

КонецПроцедуры

#КонецОбласти
