#Использовать asserts
#Использовать errors

#Область ПрограммныйИнтерфейс

Функция ПолучитьОбёрнутуюОшибку(Ошибка) Экспорт

	Попытка
		ВызватьИсключение ПодробноеПредставлениеОшибки(Ошибка);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

КонецФункции

Процедура ПроверитьКодВариантами(ИсходнаяОшибка, ОжидаемыйКод) Экспорт

	ПроверитьКод(ИсходнаяОшибка, ОжидаемыйКод);

	ОбёрнутаяОшибка = ПолучитьОбёрнутуюОшибку(ИсходнаяОшибка);
	ПроверитьКод(ОбёрнутаяОшибка, ОжидаемыйКод);

КонецПроцедуры

Процедура ПроверитьКодСНеопределяемойОбёрткой(ИсходнаяОшибка, ОжидаемыйКод) Экспорт

	ПроверитьКод(ИсходнаяОшибка, ОжидаемыйКод);

	ОбёрнутаяОшибка = ПолучитьОбёрнутуюОшибку(ИсходнаяОшибка);
	ПроверитьНеклассифицированность(ОбёрнутаяОшибка);

КонецПроцедуры

Процедура ПроверитьНеклассифицированностьВариантами(ИсходнаяОшибка) Экспорт

	ПроверитьНеклассифицированность(ИсходнаяОшибка);

	ОбёрнутаяОшибка = ПолучитьОбёрнутуюОшибку(ИсходнаяОшибка);
	ПроверитьНеклассифицированность(ОбёрнутаяОшибка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйИнтерфейс

Процедура ПроверитьКод(ПроверяемаяОшибка, ОжидаемыйКод)

	Классификатор = Новый КлассификаторНативныхОшибок;
	НормализованнаяОшибка = Классификатор.Классифицировать(ПроверяемаяОшибка);
	Ожидаем.Что(НормализованнаяОшибка).ИмеетТип("ИнформацияОбОшибке");

	Снимок = Новый СнимокКадраОшибки(НормализованнаяОшибка);
	Ожидаем.Что(Снимок.КодОшибки()).Равно(ОжидаемыйКод);
	Ожидаем.Что(НормализованнаяОшибка.Причина).Идентично(ПроверяемаяОшибка);

КонецПроцедуры

Процедура ПроверитьНеклассифицированность(ПроверяемаяОшибка)

	Классификатор = Новый КлассификаторНативныхОшибок;
	НормализованнаяОшибка = Классификатор.Классифицировать(ПроверяемаяОшибка);
	Ожидаем.Что(НормализованнаяОшибка).Идентично(Неопределено);

КонецПроцедуры

#КонецОбласти
