#Использовать asserts
#Использовать errors

#Область ПрограммныйИнтерфейс

Функция ПолучитьОбёрнутуюОшибку(Ошибка) Экспорт

	Попытка
		ВызватьИсключение ПодробноеПредставлениеОшибки(Ошибка);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

КонецФункции

Процедура ПроверитьКодВариантами(Классификатор, ИсходнаяОшибка, ОжидаемыйКод) Экспорт

	ПроверитьКод(Классификатор, ИсходнаяОшибка, ОжидаемыйКод);

	ОбёрнутаяОшибка = ПолучитьОбёрнутуюОшибку(ИсходнаяОшибка);
	ПроверитьКод(Классификатор, ОбёрнутаяОшибка, ОжидаемыйКод);

КонецПроцедуры

Процедура ПроверитьКодСНеопределяемойОбёрткой(Классификатор, ИсходнаяОшибка, ОжидаемыйКод) Экспорт

	ПроверитьКод(Классификатор, ИсходнаяОшибка, ОжидаемыйКод);

	ОбёрнутаяОшибка = ПолучитьОбёрнутуюОшибку(ИсходнаяОшибка);
	ПроверитьНеклассифицированность(Классификатор, ОбёрнутаяОшибка);

КонецПроцедуры

Процедура ПроверитьНеклассифицированностьВариантами(Классификатор, ИсходнаяОшибка) Экспорт

	ПроверитьНеклассифицированность(Классификатор, ИсходнаяОшибка);

	ОбёрнутаяОшибка = ПолучитьОбёрнутуюОшибку(ИсходнаяОшибка);
	ПроверитьНеклассифицированность(Классификатор, ОбёрнутаяОшибка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйИнтерфейс

Процедура ПроверитьКод(Классификатор, ПроверяемаяОшибка, ОжидаемыйКод)

	НормализованнаяОшибка = Классификатор.Классифицировать(ПроверяемаяОшибка);
	Ожидаем.Что(НормализованнаяОшибка).ИмеетТип("ИнформацияОбОшибке");

	Снимок = Новый СнимокКадраОшибки(НормализованнаяОшибка);
	Ожидаем.Что(Снимок.КодОшибки()).Равно(ОжидаемыйКод);
	Ожидаем.Что(НормализованнаяОшибка.Причина).Идентично(ПроверяемаяОшибка);

КонецПроцедуры

Процедура ПроверитьНеклассифицированность(Классификатор, ПроверяемаяОшибка)

	НормализованнаяОшибка = Классификатор.Классифицировать(ПроверяемаяОшибка);
	Ожидаем.Что(НормализованнаяОшибка).Идентично(Неопределено);

КонецПроцедуры

#КонецОбласти
