#Использовать errors

Перем _КодОшибки; // Строка

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта(КодОшибки = Неопределено)

	_КодОшибки = КодОшибки;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Классифицировать(Ошибка, Распознаватель) Экспорт

	Если _КодОшибки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ФабрикаОшибок.Обернуть(
		Ошибка,
		_КодОшибки,
		"Тестовая пользовательская классификация",
		Новый Структура
	);

КонецФункции

#КонецОбласти
