#Область ПрограммныйИнтерфейс

// Возвращает способ точного сопоставления сообщения.
//
// Возвращаемое значение:
//  Число - Идентификатор способа сопоставления.
Функция Точное() Экспорт
	Возврат 1;
КонецФункции

// Возвращает способ сопоставления префикса сообщения.
//
// Возвращаемое значение:
//  Число - Идентификатор способа сопоставления.
Функция Префикс() Экспорт
	Возврат 2;
КонецФункции

// Возвращает способ сопоставления префикса и окончания сообщения.
//
// Возвращаемое значение:
//  Число - Идентификатор способа сопоставления.
Функция ПрефиксОкончание() Экспорт
	Возврат 3;
КонецФункции

// Возвращает способ сопоставления нативного типа.
//
// Возвращаемое значение:
//  Число - Идентификатор способа сопоставления.
Функция ПоТипу() Экспорт
	Возврат 4;
КонецФункции

// Возвращает способ сопоставления нативного типа и окончания сообщения.
//
// Возвращаемое значение:
//  Число - Идентификатор способа сопоставления.
Функция ТипИОкончание() Экспорт
	Возврат 5;
КонецФункции

// Возвращает способ сопоставления нативного типа и фрагмента сообщения.
//
// Возвращаемое значение:
//  Число - Идентификатор способа сопоставления.
Функция ТипИФрагмент() Экспорт
	Возврат 6;
КонецФункции

// Возвращает способ сопоставления нативного типа, начала и окончания сообщения.
//
// Возвращаемое значение:
//  Число - Идентификатор способа сопоставления.
Функция ТипИОбрамление() Экспорт
	Возврат 7;
КонецФункции

#КонецОбласти
